title: Detect Command Executions from Common Locations
id: example-cmd-locations
description: Detect cmd.exe executed from common suspicious folders
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image:
      - 'C:\\Windows\\System32\\cmd.exe'
      - 'C:\\Windows\\SysWOW64\\cmd.exe'
      - 'C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe'
  condition: selection
level: medium
